emacs.d/project/projectile.org
* project-projectile
** marker
#+begin_src elisp
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;; project-projectile
  ;;;;
  ;;
#+end_src
** projectile
#+begin_src elisp
  (use-package projectile
    :init
    (when (file-directory-p "~/SRC/GITEA")
      (setq projectile-project-search-path '("~/SRC/GITEA")))
    ;; (setq projectile-known-projects-file (expand-file-name ".state/projectile-bookmarks.eld" user-emacs-directory))
    ;; (setq projectile-switch-project-action #'projectile-dired)
    (setq projectile-switch-project-action 'neotree-projectile-action)
    :diminish projectile-mode
    :config
    (projectile-mode)
    (setq projectile-create-missing-test-files 1)
    :custom ((projectile-completion-system 'ivy))
    )
#+end_src
** counsel-projectile
#+begin_src elisp
  (use-package counsel-projectile
    :config (counsel-projectile-mode))
#+end_src
